<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2018 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

return [

    // +----------------------------------------------------------------------
    // | URL设置
    // +----------------------------------------------------------------------

//    // 是否自动转换URL中的控制器和操作名
//    'url_convert'            => true,
//    // PATHINFO变量名 用于兼容模式
//    'var_pathinfo'           => 's',
//    // 兼容PATH_INFO获取
//    'pathinfo_fetch'         => ['ORIG_PATH_INFO', 'REDIRECT_PATH_INFO', 'REDIRECT_URL'],
//    // pathinfo分隔符
//    'pathinfo_depr'          => '/',
//    // URL伪静态后缀
//    'url_html_suffix'        => 'html',
//    // URL普通方式参数 用于自动生成
//    'url_common_param'       => false,
//    // URL参数方式 0 按名称成对解析 1 按顺序解析
//    'url_param_type'         => 0,



    // +----------------------------------------------------------------------
    // | 应用设置
    // +----------------------------------------------------------------------

    'default_return_type'    => 'html',

    //分页配置
    'paginate'               => [
        'type'      => 'bootstrap',
        'var_page'  => 'page',
        'list_rows' => 15,
    ]

];
